[
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b940",
    "Title": "Lakad Matatag!!!",
    "Description": "The International 2018 was the eight iteration of Dota 2's flagship annual championship. Hosted by Valve Corporation,it took place at the Rogers Arena in Vancouver, British Columbia, being the first to be celebrated outside of the United States.",
    "Content": "[p]The tournament began on 14 June 2018 with the Open Qualifiers and closed on 25 August 2018 with the Grand Final, where fan favorites OG OG defeated Chinese team PSG.LGD PSG.LGD 3-2, becoming the first Grand Final since 2013 to feature five games. With a prize pool of over US$25.3 million, The International 2018 is the largest tournament to ever take place in eSports, breaking the record held by its previous iteration, The International 2017, which accumulated over U$24 million.[/p][p] The majority of this sum is collected through several in-game items released by Valve, including the The International 2018 Battle Pass, a digital tournament pass and features bundle tied to the event that included many activities and cosmetic items. 2018 marks the fifth consecutive year that The International's prize pool outgrows its previous-year record.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b941",
    "Title": "Spiderman Dies in Avengers: Infinity War",
    "Description": "AVENGERS INFINITY WAR director Joe Russo just confirmed the painful truth behind Spider-Man's death.",
    "Content": "[p]Spider-Man's death scene in Avengers: Infinity War originally wasn't as long. Marvel Studios did what many thought they wouldn't when it came to the end of Infinity War and the deaths it would have. Fans expected the older guard to say goodbye, but they're actually the last ones standing. [/p][p]This has led to some sidestepping from Marvel, as many of the 'dead' heroes are going to be returning for future films. [/p][p]Tom Holland's Spider-Man is the prime example, as he turned to dust at the end of Infinity War but has Spider-Man: Far From Home hitting theaters two months after Avengers 4.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b942",
    "Title": "Three Online PTQs this Weekend",
    "Description": "Monday is a holiday in the US – Memorial Day – so Wizards is giving us three MTGO PTQs this weekend.   Saturday is Standard, beginning at 9am PT. Sunday’s PTQ is Sealed starting at 7am PT. Monday’s Modern PTQ starts at 9am PT.",
    "Content": "[p]Wizards Announcement Day was last Friday.   The article and video are here. Here’s the really short version of what was a pretty short set of announcements: *The superfriends are back – on Ravnica. *Guilds of Ravnica set drops in fall, featuring the Golgari, Izzet, Dimir, Selesnya and Boros Guilds.  *Ravnica Allegiances comes out in January, with the other five Guilds. *Another Ravnica set will appear later, and will feature a big story arc conclusion.*Theme decks will appear in fall – one precon per Guild. [/p][p]These will likely be paper only.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b943",
    "Title": "Facebook is developing its own clone of the popular TikTok app",
    "Description": "Facebook is looking to create another standalone app to compete with TikTok, the immensely popular 15-second video app, which recently absorbed Musical.ly after a $1 billion acquisition by Chinese company ByteDance.",
    "Content": "[p]According to a TechCrunch report, Facebook is trying to win over teens with Lasso, an app where users can record themselves dancing and lip-syncing to music. A source told TechCrunch, “It’s basically TikTok/Musically. It’s full-screen, built for teens, fun and funny, and focused on creation. A lot of what they’re doing is just trying to be cool.' [/p][p]The report comes on the heels of Facebook’s new music features that launched yesterday, in which the company added music stickers to its Stories feature and rolled out lyrics to its Lip Sync Live feature that already lives within its own app. Lasso would most likely be the standalone app version of Lip Sync Live.[/p][p] With licensing deals secured with all of the major labels, however, Facebook would have access to songs that are longer than TikTok’s 15-second limit.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b944",
    "Title": "Recently Published Book Spotlight: Consciousness in Locke",
    "Description": "Shelley Weinberg is an associate professor of philosophy at the University of Illinois at Urbana-Champaign specializing in early modern philosophy.",
    "Content": "[p]I suppose what I like most about the book is the way in which it tries to tie together some of the most important aspects of Locke’s philosophy by tracing a single thread.  Much recent work in Locke scholarship has focused more on the metaphysics and natural philosophy.  Though I do have chapters on personal identity and freedom and moral motivation, my focus is really more on the epistemology and philosophy of mind and how Locke’s fundamental understanding of the mind underwrites much of the rest of the philosophy – particularly the metaphysical aspects mentioned above. [/p][p]I’ve been very lucky in that the book has been well received.  I was honored with the Journal of the History of Philosophy’s 2017 prize for the best book in the history of philosophy published in 2016. [/p][p] That was quite a surprise and really something for me!  I came to the Academy rather late in life as a second career.  At first, I was happy just to get through graduate school, and then to get a job, and then to publish a book.  (As some may not yet realize, with a little bit of age comes a lot more tiredness!)  To have my work singled out for a prestigious prize was beyond my imagination.  Just as meaningful to me personally, though, have been the acknowledgements and kind words of many of my Locke studies colleagues.  They are a fantastic group of people (and scholars) – so collegial, so helpful, and a lot of fun.  I’m honored in so many ways to be among them.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b945",
    "Title": "Upcoming Black Ops 4 Updates Will Address Network Performance",
    "Description": "In Black Ops 4's latest patch notes, developer Treyarch has revealed that it will implement updates over the next few weeks to improve the game's network performance.",
    "Content": "[p]Treyarch has been rolling out updates for Call of Duty: Black Ops 4 on a near-daily basis since the shooter launched earlier this month. On top of the latest patch, which makes stability improvements to all modes across PS4, Xbox One, and PC, the developer has shared with fans other aspects of the game it will continue to refine in the coming weeks. [/p][p]In a post on Reddit, Treyarch discussed its plans to further optimize Black Ops 4's network performance. We're constantly working to optimize the game, and particularly network performance, to ensure the highest quality online experience for our players,' the developer wrote. 'Now that we're past the initial launch of the game, we are focusing on fine-tuning network performance around the globe, using the real-world data that we have collected. [/p][p]Over the course of the next two weeks, we will roll out several updates to our network setup that will continue to improve upon the experience of our players since launch. As we have always said, launch is just the beginning, and we're committed to making Black Ops 4 the best-supported game we've ever delivered. The latest Call of Duty: Black Ops 4 update resolved crashes and other issues across Multiplayer, Blackout, and Zombies modes. This follows the patch Treyarch rolled out last week, which made various fixes to Zombies mode. The developer says it is also investigating other Zombies bugs and will provide an update on those issues in the coming days.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b946",
    "Title": "Spike Lee is Not Making Sony Marvel's Nightwatch Movie",
    "Description": "Spike Lee says he's not working on Sony Marvel's Nightwatch comic book movie adaptation. The Nightwatch character originated in the Web of Spider-Man comics back in 1993 and has been tapped to star in a film of his own since late last year.",
    "Content": "[p]Lee has been linked to the project since it was originally announced and reportedly entered talks to direct back in March, with a script in place by Marvel Netflix's Luke Cage creator and (now, former) showrunner, Cheo Hodari Coker. Nightwatch, aka. Dr. Kevin Trench, is a vigilante who fight crimes by using a technologically-advanced costume that he got from himself - more specifically, a future version of himself, whom Dr. Trench witnessed being killed in a battle one night. [/p][p]The superhero is one of 900 Marvel characters that Sony has the film rights to and intends to bring to the big screen, as part of the Spider-Man antihero and villain franchise that this year's Venom has now successfully kicked off. [/p][p]However, it appears that Lee won't be the filmmaker responsible for retelling Dr. Trench's story after all. In an interview with Screen Rant to promote his acclaimed true story-based film BlacKkKlansman (which hit U.S. theaters this past summer), Lee praised Marvel and Ryan Coogler's Black Panther for the impact it will have on black filmmakers and their efforts to get their movies green-lit in the future. However, when we asked Lee if he's currently planning to make his own black superhero adventure in the form of Nightwatch, the director responded with a simple 'Nah'.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b947",
    "Title": "Adapting A Magic: The Gathering Card Into A Life Size Cosplay Weapon Is Cool",
    "Description": "There are quite a few equipment cards in Magic: The Gathering that get players excited, but the ever-scary Bonesplitter has been cleaving through enemies since it was printed in the Mirrodin set fifteen years ago. And now you can see how you might recreate it in real life.",
    "Content": "[p]The YouTube channel Odin Makes is generally centered on cosplay builds and prop recreations, and so it is particularly inspiring to see host Odin take a 2D image from a Magic card and transform it into a short, brutal foam and wood axe. When you play Bonesplitter in Magic, you’re generally putting it into the hands of a flying fairy or a rambunctious goblin.[/p][p]It makes a creature more powerful, so it can “trade up” by destroying creatures bigger than it or by flying over blockers to smash your opponent in the sky. And wouldn’t you know it, but this physical version of that axe looks exactly like it belongs in that exact scenario. Just imagine handing it off to a avian human who will use it for big air battles. [/p][p]Odin Makes has done several game-centered builds, including a Super Sledge from Fallout 4, a Pip Boy, and the Leviathan Axe from God of War.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b948",
    "Title": "Parrot releases useful new photo modes for its Anafi drone",
    "Description": "Parrot debuted its folding Anafi drone this past summer, and now it’s releasing a software update to add functionality to its camera. Parrot is also launching what it calls Anafi Extended, a package deal that includes the drone, a carrying case, and two spare batteries.",
    "Content": "[p]All this news comes ahead of the holiday season when, presumably, Parrot is hoping to sell some drones. [/p][p]The camera updates include:[ul][li]HDR+, which Parrot says should offer a wider dynamic range for photos and videos taken with the drone[/li][li]Panorama photo mode, which includes a bunch of different options including vertical panorama, horizontal panorama, and a panorama sphere that rotates the drone 360 degrees as its camera vertically sweeps the scene at 180 degrees.[/li][li]Dolly Zoom on a point of interest, which lets you use a dolly zoom while focusing on a specific thing, like a building. (The Dolly Zoom existed on the original software release but not with the point of interest option.) [/li][li]Hyperlapse that’ll allow users to video record and play back at 15x, 30x, 60x, 120x, or 240x the speed. (It existed before but not up to 240x.) [/li][li]Slow motion now shoots at 120 fps at a 720P resolution.[/li][/ul][/p][p] While those features might be immediately nifty for current Anafi owners, Parrot is also introducing its Anafi Extended pack to lure in new buyers with several extras. The spare batteries typically cost $99.99, and the drone goes for $649.99. The package costs $799.99, so it’s definitely a better deal than buying everything individually.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b949",
    "Title": "Kant and Hegel in Sellars’ Space of Reasons?",
    "Description": "Willem A. deVries and James O’Shea says it has often been noted that philosophy, at least on most self-understandings of the discipline has a uniquely important relationship to its historical past.",
    "Content": "[p]As Wilfrid Sellars (1912–89) once put the claim rather strongly in his 1968 book, Science and Metaphysics: Variations on Kantian Themes: The history of philosophy is the lingua franca which makes communication between philosophers, at least of different points of view, possible. Philosophy without the history of philosophy, if not empty or blind, is at least dumb. [/p][p]Sellars would no doubt have been pleased to have witnessed that in the decades since his death his own broadly “analytic” philosophy is now frequently placed in a line of thinking that traces back both to the German idealism of Kant and Hegel, and to the American pragmatist and scientific naturalist traditions.  [/p][p]In particular, the views of Kant and Hegel are now regularly discussed in relation to Sellars’ famous critique of what he called the myth of the given, in which he argued against ‘the given’ understood roughly as the idea that at bottom all of our knowledge must ultimately rest on some foundation or other of directlyself-evident principles or experiences.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b950",
    "Title": "Battlefield 5's 'Firestorm' Battle Royale Coming In 2019",
    "Description": "You won't be able to play Battlefield's take on the battle royale until next spring, according to a post-launch roadmap released by DICE today.",
    "Content": "[p]'The battle royale mode for Battlefield V will come next March,' DICE has announced. A post on the official site detailed the post-launch roadmap, and announced that the \"Firestorm\" Battle Royale mode will come in March 2019. That's the third chapter of its planned content, to follow Chapter 1 (Overture) and Chapter 2 (Lightning Strikes). [/p][p]Overture will bring the tank-focused Panzerstorm map, a new War Story called The Last Tiger, and new vehicle customization features. It's coming roughly two weeks after launch. Then sometime between January and March, Lightning Strikes will add Combined Arms and Squad Conquest. Firestorm will support up to 64 players, divided into teams of four. [/p][p]It gets its name from a ring of fire that will close throughout the match, as players scrounge for weapons and fight to be the last team remaining. It's being developed by Criterion rather than DICE.[/p][p] We still don't know much about Firestorm on the whole, considering it wasn't part of the beta. Battle royale modes are popping up in more games recently. Call of Duty: Black Ops 4, Battlefield's chief competitor in the military shooter genre, launched with its own battle royale mode called Blackout.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b951",
    "Title": "Outlaw King Full Trailer: Chris Pine Fights for Scotland's Freedom",
    "Description": "In August, Netflix unveiled the first trailer for David Mackenzie’s Outlaw King prior to the film’s world premiere at the Toronto International Film Festival and now in the second trailer, Chris Pine’s rebel character rallies the troops and anticipates death.",
    "Content": "[p]Based on the “untold story” of Robert the Bruce, a warrior who became the King of Scotland, Outlaw King is the latest theatrical collaboration between Mackenzie and Pine. In 2016, the Scottish director enlisted the American actor for Hell or High Water, a neo-Western crime thriller in which two brothers seek revenge in Texas. [/p][p]Based on a script by Taylor Sheridan (Sicario, Wind River, Sicario: Day of the Soldado), Hell or High Water ultimately earned four Oscar nominations, including one for Best Picture, thus creating buzz for another Mackenzie-Pine production. In August 2017, the combo began shooting Outlaw King in Scotland, with Aaron Taylor-Johnson (Avengers: Age of Ultron) and Florence Pugh (Lady Macbeth) in supporting roles.  [/p][p]Today, Netflix released Outlaw King’s second trailer, building upon the mythology established in the original clip. From the start, Pine’s dialogue sets the tone, as Robert the Bruce notes that “the survival of the Scottish is at stake.” Compared to the sweeping cinematography highlighted in trailer #1, the new trailer mostly emphasizes war and impending death, complemented by hard-hitting sound editing. Many of the same shots are used, however trailer #2 establishes a more epic feel, heavily contrasting Robert the Bruce's peaceful commitment to the people with his eagerness to fight the enemy - in this case, English soldiers. During the final 10 seconds, the heightened music and dramatic dialogue creates a chilling atmosphere for what seems to be a heavy-duty war film.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b952",
    "Title": "Arena's Open Beta Is A Good Way To Play Magic: The Gathering, But It Has Some Pitfalls",
    "Description": "Magic: The Gathering Arena is the venerable card game’s new entry into the digital space, and the free-to-play game is finally in open beta on PC after several months of closed beta. I’ve been playing it for those several months. I have some opinions.",
    "Content": "[p]If you aren’t aware of Magic: The Gathering, it is a card game where players pretend to be wizards who summon creatures and sling spells at each other. Originally released in 1993, the game is notable for being both compelling to play and very difficult to learn. Magic: The Gathering Arena steps in here to take care of all that complexity for you.[/p][p] It keeps the stuff that makes Magic a unique game while jettisoning the immense mental load that often gets in the way of pretending that you’re a wizard, and it is a surprisingly smooth way to play the game. Arena is aware that one of the pitfalls of Magic is learning to play the game, and when you open the beta and create an account you are treated to a pretty good tutorial that walks you through how it works.[/p][p] The tutorial for Arena spends most of its time getting you acclimated to how the general flow of the game goes, with its turn order and the phases of those turns, and as a player with more than a decade of experience trying to teach other people the game, I appreciate the clarity of that tutorial. Beyond that, Arena doesn’t hold a player’s hand. It guides you to a menu where you can play “ladder” matches, and it also forces you to use some of your starting account gold to buy a pack of cards (I hate this, despite understanding why you would want to educate players on how to buy cards). After that, you’re free to play digital Magic to your heart’s content with the knowledge you’ve built. You can do daily quests, win packs of cards, grow your collection, and use that collection to play the game. Bing bang boom.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b953",
    "Title": "Google’s Night Sight for Pixel phones will amaze you",
    "Description": "Google’s Pixel phones have already changed and improved smartphone photography dramatically, but the latest addition to them might be the biggest leap forward yet.",
    "Content": "[p]Night Sight is the next evolution of Google’s computational photography, combining machine learning, clever algorithms, and up to four seconds of exposure to generate shockingly good low-light images. I’ve tried it ahead of its upcoming release, courtesy of a camera app tweak released by XDA Developers user cstark27, and the results are nothing short of amazing.[/p][p] Even in its pre-official state before Google is officially happy enough to ship it, this new night mode makes any Pixel phone that uses it the best low-light camera. Let’s take a look at a few examples, shall we? All of the shots below are taken with the Pixel 3 XL: first with the default settings and second with the night mode toggled on. [/p][p]Google claims Night Sight will save you from ever having to use the flash again, and so naturally, I didn’t use it with any of these images. If you listen closely, you might be able to hear every other phone camera engineer flipping their desk and resigning in disgust. This is just an astonishing improvement. The Pixel 3’s camera is already among the very best low-light performers, so when a scene is so dark that it barely registers anything, you know there’s hardly any light. And yet, with Night Sight on, we actually see a scene that looks like a moderately noisy daytime shot.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b954",
    "Title": "Hauntings, haints, and wraiths of every stripe and disposition appear in today’s literary fiction. But what to make of literature’s spectral moment?",
    "Description": "In 1960, the literary critic Leslie Fiedler delivered a eulogy for the ghost story in his classic study “Love and Death in the American Novel.” “An obsolescent subgenre,” he declared, with conspicuous relish; a “naïve” little form, as outmoded as its cheap effects, the table-tapping and flickering candlelight. Ghost stories belong to — brace yourself for maximum Fiedlerian venom — “middlebrow craftsmen,” who will peddle them to a rapidly dwindling audience and into an extinction that can’t come soon enough.",
    "Content": "[p]Not since Herman Melville’s publishers argued for less whale and more maidens in “Moby-Dick” (“young, perhaps voluptuous,” they dared to dream) has a literary judgment been so impressively off the mark. Literature — the top-shelf, award-winning stuff — is positively ectoplasmic these days, crawling with hauntings, haints and wraiths of every stripe and disposition.[/p][p] These ghosts can be nosy and lubricious, as in George Saunders’s “Lincoln in the Bardo,” which followed a group of spectral busybodies in purgatory, observing the arrival of Abraham Lincoln’s newly deceased young son. They can be confused by their fates, as in Martin Riker’s new novel, “Samuel Johnson’s Eternal Return,' in which a man is unsettled to discover that his essence has migrated into the body of the man who killed him. [/p][p]Spirits crop up in fiction about migration (Viet Thanh Nguyen’s “The Refugees”; Wayétu Moore’s “She Would Be King”) and complicate what might have been straightforward portraits of relationships (Ben Dolnick’s “The Ghost Notebooks,” Laura van den Berg’s “The Third Hotel,” Lauren Groff’s “Florida,” Helen Sedgwick’s “The Comet Seekers”). They terrify, instruct and enchant — sometimes all in the same book (Carmen Maria Machado’s short story collection, “Her Body and Other Parties,” features a veritable taxonomy of the type). M.R. James, the Edwardian master of the ghost story, once listed the crucial features of the form, including distant screams, no sex and “a modicum of blood, shed with deliberation and carefully husbanded.” But the ghost story has always floated free of such strictures. The protagonist of James’s era — the scholar in his dim library — was supplanted in our imaginations by curious young women roaming gloomy manors and innocently unleashing hell. Think “The Turn of the Screw,” “The Haunting of Hill House” or any number of Edith Wharton’s classics of the genre. Stories came lavishly garnished with sex and gore.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b955",
    "Title": "Pokemon: Meltan's Evolution, Melmetal, Revealed; Here's How To Get It",
    "Description": "Let's Go Pikachu and Eevee's new Mythical Pokemon has an evolved form; here's how you'll be able to obtain one in the upcoming Nintendo Switch games.",
    "Content": "[p]The Pokemon Company has been gradually revealing more details about the new Pokemon Meltan since it (sort of) debuted in Pokemon Go following September's Community Day event. Earlier this month, we got a look at a possible second form the Mythical Pokemon would be able to assume, and now The Pokemon Company has confirmed it is indeed an evolution dubbed Melmetal.[/p][p]Like its base form, Melmetal is a pure Steel-type Pokemon whose body is made up primarily of liquid metal. According to the Pokemon website, Melmetal was worshiped in ancient times because of its ability to create metal, and it is capable of learning a brand-new move called Double Iron Bash, a two-hit Steel-type attack that can make the opposing Pokemon flinch.[/p][p]The Pokemon Company also revealed how players will be able to obtain Melmetal in the upcoming Pokemon: Let's Go Pikachu and Let's Go Eevee games for Switch, and it once again involves linking up with Pokemon Go. After you catch a Meltan in the mobile game, you'll need to feed it a lot of Candies to make it evolve--400, to be exact. These can be acquired by catching more Meltan in the wild, sending some to Professor Willow, and transferring some to the Switch titles. Once it has evolved, you'll then be able to send Melmetal over to Let's Go Pikachu or Eevee.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b956",
    "Title": "Boyhood's Richard Linklater Directing Bill Hicks Biopic",
    "Description": "Boyhood director Richard Linklater is set to helm a Bill Hicks biopic. Hicks began his stand-up comedy career at a young age but would come to prominence during the '80s and early '90s with a series of successful tours and television appearances.",
    "Content": "[p]Sometimes controversial, often insightful and always entertaining, Hicks' dark and satirical brand of humor touched on a number of sensitive subjects including politics, religion, drugs, spirituality and modern culture. Tragically, Hicks passed away at the age of 32 due to pancreatic cancer but his legacy has only grown in his absence and the comedian is often cited as one of the best stand-up acts of all time.[/p][p]Since his death, many have sought to tell the fascinating story of Bill Hicks' life and the most notable effort came in the form of 2009's American: The Bill Hicks Story which premiered at the 2010 SXSW film festival. However, there have been rumors of a Hicks biopic circling since 2012, when it was reported that Russell Crowe would be directing and starring in such a project. News of that effort has been quiet in the six years since but it now appears that the wheels are again turning on a Bill Hicks movie, albeit with no mention of any involvement from Crowe.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b957",
    "Title": "The Perfect Beer Pairings For Magic Cards",
    "Description": "An Instagram account called “jokulhops” is pairing specific Magic cards with beers that seem to go with them. This is the kind of Magic content that I enjoy.",
    "Content": "[p]As you can see in the header, the delicious peach fruit that the Spike Feeder is, well, feeding on looks juicy and amazing. What better way to really get into the head space of this card than enjoying a nice, cold beverage made from a similar stone fruit?[/p][p]The amazing part about the account is the fact that there are lots and lots of Magic cards with conceptual beer counterparts. You should definitely go scroll through.[/p][p]I love the sense of humor to the account. After all, Magic is a massive game with lots and lots of goats, so why not create a goat collection? And, somehow, there is a beer centered on that.[/p][p]Alongside jokulhops, there is also the beer-and-Magic themed [i]mtg_brews[/i] which goes for a similar approach in a slightly more artful way. If you’re trying to find beer-and-Magic content, it exists.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b958",
    "Title": "Twitter loses 9 million users amid bot crackdown",
    "Description": "Twitter’s monthly user count took another hit last quarter, diving by 9 million amid an ongoing crackdown meant to rid the platform of bots, spam, and other problematic accounts. The company said this morning that its monthly user base fell to 326 million from from 335 million the prior quarter, marking the second quarter in a row of declines.",
    "Content": "[p]The decline wasn’t unexpected. Twitter said last month that it had begun wiping out bad accounts far more rapidly. And the company warned that it could lose [i]mid-single-digit millions[/i] more in the coming months, due to new technology that helped spot bad actors and prevent them from getting on the platform in the first place. Evidently, Twitter ended up wiping out more bad accounts than it added real accounts. (Or it lost some real ones, too.)[/p][p][i]We do see health [of the platform] as a growth vector over the long term,[/1] Jack Dorsey, Twitter’s CEO, said during a call with investors this morning. [i]This is an extremely important initiative to us, not only for the experience of Twitter, but we believe the long-term growth of the platform.[/i][/p][p]Cleaning out these accounts ought to lead to a better overall service. But for the time being, the adjusted figures illustrate how poorly Twitter has been growing. Not only has it lost users this year, its total user count is back to where it was at the start of 2017. For comparison, Facebook added 38 million monthly users just last quarter.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b959",
    "Title": "It Keeps Me Seeking",
    "Description": "Sometimes spouses will look back on the time of their getting to know one another and say, half-jokingly, that on a given occasion one was putting the other to the test.",
    "Content": "[p]A person keen on hill-walking might invite their loved-one on an expedition in the Lake District; they want to know if their friend will enjoy it and thus [i]pass[/i]. One keen on theatre might invite a loved-one to a play; they want to know if their friend will appreciate it and thus [i]pass[/i]. Such [i]tests[/i] are, up to a point, a natural part of any developing friendship, but you can’t spend your whole life that way. If it is just test after test then the friendship is not developing, and indeed is liable to drain away. Eventually friends come to know one another well enough that they wish to develop the relationship by other means: they wish to achieve something together. This [i]knowing[/i] is human [i]knowing[/i] —the French connaître and the German kennen, as opposed to savoir and wissen. It does not mean the absence of uncertainty; it means the presence of trust.[/p][p]All this carries over quite well (not perfectly well, but quite well) to what is going on when some kinds of religious talk makes reference to [i]knowing[/i] God. To [i]know[/i] God in this sense does not imply the absence of uncertainty; it does imply the decision to keep going, and to seek to achieve something worthwhile.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b960",
    "Title": "Red Dead Redemption 2 Companion App Revealed: Here's what it does",
    "Description": "The official RDR 2 app is releasing on mobile devices alongside the game later this week.",
    "Content": "[p]Red Dead Redemption 2's release date is nearly upon us, but the magic date of October 26 will also see the launch of the game's official companion app, publisher Rockstar has confirmed. The app will go live on iOS and Android day-and-date with the main game this Friday.[/p][p]Essentially, it appears the app will act as a second screen for you to use while playing the game on your PS4 / Xbox One and TV. That means you can look at the map and add waypoints or mark areas of interest all on your iPad, for example. In addition, the app will display [i]Arthur Morgan's core info and stats in real-time on your device, allowing you to completely remove the in-game HUD from your television should you choose.[/i][/p][p]Finally, the app contains the full digital game manual, provides stat tracking through Rockstar's social club, and offers an optional digital version of the official Red Dead Redemption 2 guide, presumably for an extra cost.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b961",
    "Title": "My Hero Academia Live-Action Movie In Development At Legendary",
    "Description": "Legendary has announced its intent to produce a live-action adaptation of popular anime and manga My Hero Academia. Hollywood has long been obsessed with bringing popular Japanese anime/manga series to American audiences, usually as live-action blockbusters with A-list actors taking up pivotal roles.",
    "Content": "[p]Due to the complex and usually long-form nature of anime, however, studios often change or condense these stories to appeal to a wider audience.[/p][p]This strategy has not really worked thus far for studios, as most live-action anime adaptations are poorly received by both audiences and critics alike (last year’s Ghost in the Shell is a fairly recent example of this, as the film bombed at the box office). With this in mind, it’s certainly a risk for Legendary to attempt to bring My Hero Academia to the big screen for American audiences. However, due to the superhero-like nature of the story and the current box office dominance of superhero movies, perhaps it’s a risk that will pay off for the studio.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b962",
    "Title": "Pro Magic Player Protests World Championships, Hoping To Change The Pro Scene",
    "Description": "Magic: The Gathering pro player Gerry Thompson says he is protesting this weekend’s World Championship event, the game’s most prestigious tournament, citing complaints about how Magic publisher Wizards of the Coast is handling its pro scene.",
    "Content": "[p]Thompson is a two-time winner of Magic’s Grand Prix and, in 2016, he earned first place at the Pro Tour. Achieving that level of success with the ever-changing card game’s constructed format requires a significant amount of time studying Magic sets, learning opponents’ strategies and building decks. In a Reddit post today, Thompson wrote that one of the difficulties with the pro scene is that Wizards of the Coast does not pay professional players a living wage.[/p][p]For ten years, Thompson has had concerns over the way Wizards of the Coast handles Magic’s pro scene, he told Kotaku over the phone from his hotel room in Las Vegas, where the tournament is currently underway. Now, he said, [i]enough is enough.[/i] When asked why he initiated the protest on the day of the tournament, Thompson said, [i]I knew I was gonna do this for about a month and a half. . . Me doing this the day of the event means the tournament is going to be short a player. It is going to be a thing. Even if people don’t see my Reddit post or tweet, people are going to ask why there are 23 players. It was calculated.[/i][/p][p]Magic players can earn money from prize pools, and sometimes, Wizards of the Coast pays for travel and appearance fees for certain high-level players. The company doesn’t pay players a salary, however. Thompson conceded that this should not be a requirement, but he went on to write in his post, [i]If the goal is to sell the dream of playing on the Pro Tour, there should be something in place to make that worth achieving. Between qualifying becoming more and more difficult, especially with the goal posts continually changing, and the lack of reward at the top, the message currently being sent is ‘don’t waste your time.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b963",
    "Title": "Xiaomi announces Mi Mix 3 with sliding cameras and no notch",
    "Description": "Xiaomi has announced the Mi Mix 3, the latest entry in its series of full-screen flagship phones. It’s yet another high-end Chinese device with a huge screen-to-body ratio achieved by hiding the front-facing cameras on a sliding mechanism — no notch required. Unlike the Vivo Nex or Oppo Find X, however, the slider isn’t powered by motors. CEO Lei Jun compares the design to older sliding phones and suggests that it’ll be relaxing just to play with.",
    "Content": "[p]The previous two Mi Mix phones were both pioneering attempts by Xiaomi to reduce the bezels around the screen as much as possible, but they predated the now-ubiquitous notch and compromised by awkwardly placing the selfie camera below the screen, forcing you to hold the phone upside-down or deal with an unflattering angle. Even Xiaomi itself adopted the notch earlier this year with the Mi 8. But the Mi Mix 3 preserves the spirit of the series while seemingly fixing one of its bigger flaws.[/p][p]Xiaomi claims a screen-to-body ratio of 93.4 percent, and has cut down on the [i]chin[/i] at the bottom of the display by nearly 4.5 millimeters compared to the Mi Mix 2S.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b964",
    "Title": "Women in Philosophy: Interview with Lauren Freeman, Editor of the APA Newsletter on Feminism and Philosophy",
    "Description": "This is an interview with Lauren Freeman, the newly appointed editor of the APA Feminism and Philosophy Newsletter. The interview was conducted via email.",
    "Content": "[p]I’m an Associate Professor in the Department of Philosophy at the University of Louisville in Kentucky. I’m also an affiliated faculty member in Women’s and Gender Studies, a core member of the M.A. in Bioethics and Medical Humanities, a collaborator with University of Louisville’s School of Medicine’s eQuality Project, and a former collaborator with the Center for Mental Health Disparities (in the Department of Psychology). I do research in feminist bioethics, philosophy of medicine, feminist philosophy, phenomenology, philosophy of emotion, and philosophical pedagogy.[/p][p]Currently, I’m editing Philosophy and Microaggressions (forthcoming 2019, Routledge) with Jeanine Weekes Schroer and writing a book called Microaggressions in Clinical Medicine with Heather Stewart. I also guest edited the Fall 2018 issue of The International Journal of Feminist Approaches to Bioethics, entitled Feminist Phenomenology, Medicine, Bioethics, and Health. All of these projects combine my interests in a variety of different areas in philosophy.[/p][p]Outside of my professional life as a philosopher, with my partner (another philosopher) we co-parent a reserved six-year-old and a wildly precocious three and a half year old both of whom keep us extraordinarily busy and who compel us to use our skills and training in reasoning and argumentation in ways that we never imagined we’d have to (thanks, philosophy!). I’m also a runner, biker, and avid ashtanga yoga practitioner.[/p][p]I was just looking at the Submission Guidelines and Information for the Newsletter, which says, [i]The purpose of the newsletter is to publish information about the status of women in philosophy and to make the resources of feminist philosophy more widely available.[/i] How do you understand this purpose?[/p][p]I’m really excited about the mission of the Newsletter and in particular, in interpreting it as broadly as possible. I hope that the Newsletter will address both academic issues in contemporary feminist philosophy, but also issues that might affect and be relevant to feminist and female-identified philosophers outside of the academy, outside of the classroom, and in our personal and public lives. As such, I hope that the Newsletter can be a forum in which feminist and female-identified philosophers can do solid academic philosophy and also public philosophy.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b965",
    "Title": "Fortnite: Where Are Gargoyles To Dance At?",
    "Description": "Here's where you'll need to go to do one of the hardest challenges in day one of the Fortnitemare event on PS4, Xbox One, PC, Switch, and mobile.",
    "Content": "[p]As part of Fortnitemares, the new Halloween-themed event that has descended upon Fortnite's island, players have a new set of challenges to complete. Unlike the weekly challenges, completing these won't unlock Battle Stars for you to level your Battle Pass up. Instead you'll get experience points and specific rewards such as an emoticon, a spray, a contrail, and a glider. However, Epic is rolling out new challenges every two days, and to get that glider you'll need to complete all of them.[/p][p]The first set is available now and you can get the details on the Fortnitemares challenges in our roundup guide. There are four challenges in total, and while three of them are fairly straightforward, one specific challenge will take a fair bit of leg work. This challenge asks you to dance in front of five different Gargoyles. The trouble is, these are spread all over the Island, so you may end up wasting time running into dead-ends. Luckily, we've managed to find them and can give you their exact locations to save you the time and effort.[/p][p]Below you’ll find a map with the exact locations of the Gargoyles as well as a list of where they are. You can also watch the video above to see us complete the challenge.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b966",
    "Title": "Zack Snyder Reveals Part of Justice League's Original Ending",
    "Description": "Part of Justice League's original ending from Zack Snyder's version has been (possibly) revealed. Warner Bros. handed the keys to the DC kingdom over to Snyder when it was decided that Man of Steel would be the start of something greater.",
    "Content": "[p]He went on to direct Batman v Superman: Dawn of Justice, but the divisive response changed what else Snyder had in mind. Instead of a five-film DCEU story where Justice League was the third chapter, it was tinkered with tremendously - especially after he left.[/p][p]One of the rumors that arose after Joss Whedon took over Justice League to oversee reshoots was that the ending of Snyder's story was being overhauled. Based on reports that Darkseid was going to be set up as the big bad of Justice League 2, it appeared Whedon and WB were scrapping any Darkseid set up.[/p][p]A fan on Vero posted a still from the Justice League special features that showed the team fully assembled and looking up. Based on the amount of green screen and the set they are standing on, it is clear this is from the third act of the movie. The fan asked to see if Snyder could comment on what was being shown and Snyder did just that. In doing so, Snyder revealed that the image below is from Justice League's finale - and that they were staring up through a boom tube.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b967",
    "Title": "Painting A Beautiful Magic Card Looks Very Difficult",
    "Description": "Noah Bradley, an artist who has painted lots and lots of Magic cards, has released a time lapse video of his painting that illustrates the card New Horizons from Magic’s Ixalan set. Painting seems pretty hard!",
    "Content": "[p]Bradley is known for his big vistas and great-looking lands, and it’s no surprise that he’s literally creating a beautiful...horizon for these dinosaurs to check out. I don’t know much of anything about the actual process of digital painting, and so Bradley’s process is fascinating to me.[/p][p]His use of the transform tools is particularly interesting because he seems very willing to manipulate anything that doesn’t seem to fit or work just right. Just by watching the video, you get a sense of how he sees shapes and light working with each other, and after those big things are decided everything just sort of falls into place.[/p][p]Or, rather, things fall into place over what appears to be a few hours.[/p][p]This isn’t Bradley’s first video that showed his process for painting a Magic card. You can see his process video for the card Endless Sands and lots of other painting-oriented stuff on his YouTube channel.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b968",
    "Title": "Amazon’s Echo and Alexa devices come to Spain and Italy",
    "Description": "Amazon is bringing Alexa and Echo devices to Spain and Italy, months after it announced support for Spanish and Italian languages for its digital voice assistant. You can now preorder devices like the Echo, Echo Plus, Echo Dot, Echo Spot, and Echo Sub in Italy and Spain. They begin shipping next week, the company says.",
    "Content": "[p]It’s likely Amazon wanted to wait until Alexa supported those countries’ languages before selling the devices there, as it has in other international markets. In addition to language support, the Echo devices in Italy and Spain are also getting culture-specific updates to better reflect the countries they’re in. For instance, by partnering with local brands, Amazon made its Echo devices capable of suggesting local news articles and even regional recipes to try cooking at home.[/p][p]AMAZON’S EXPANSION INTO INTERNATIONAL SEAS HAS BEEN DRAWN OUT[/p][p]Amazon has drawn out its rollout to other countries, making expansions few and far between. France, for instance, just got the devices this summer. The slow pacing could be because it just takes time to teach a voice assistant a new language. Currently, Alexa can only speak and understand English, Spanish, Italian, German, and Japanese. Most of its growth has been in English-speaking countries.[/p][p]In the race to learn more languages, Apple’s Siri leads the pack with support for 20 languages, while the Google Assistant speaks 16, and Microsoft’s Cortana speaks over seven. Google claims by the end of this year, its assistant will be able to support over 30 languages.[/p][p]Meanwhile, voice assistants in China trail behind, as most by companies like Baidu and Xiaomi can only speak and interpret Mandarin Chinese, and not even other dialects of Chinese, underscoring how difficult it can be to train an AI in multiple complex languages.[/p]"
  },
  {
    "Id": "3a88bea9-8a65-4c23-941a-972a6195b969",
    "Title": "The Vim Podcast: Philosophy Outside Academia",
    "Description": "The Vim Podcast is the podcast of a group of academic philosophers who have banded together to think about our current political environment.",
    "Content": "[p]The Vim Podcast is the podcast of a group of academic philosophers who have banded together to think about our current political environment. Our primary outlet is the Vim blog. There we publish internally reviewed articles on topics like economic anxiety, gun control, the ethics of Facebook and AI, lying politicians, hypocrisy in politics, fascism, and how to talk to Trump supporters.[/p][p]On the podcast vimmers usually discuss ideas found on the blog. We take an article and dig deeper. Sometimes, in our [i]The Vim Reads the News[/i] episodes, we discuss an article found elsewhere.[/p][p]The best description of what we do is found in a series of articles at the Vim blog called [i]What Philosophy Owes Society.[/i] The series explores the various ways that philosophy, in content and practice, is always political. The current crisis of critical thinking should serve as a call to arms for philosophers to aid the society that provides them with careers and comfort. The Vim is born out of the awareness that philosophers are always grounded in the world of politics. There is no denying it. The attempt to do so is itself a political act.[/p][p]How then should philosophers answer the call?[/p][p]The podcast, like the articles, is meant to be a new type of public philosophy—one not preoccupied with translating academic approaches to academic problems into [i]everyday[/i] language. The [i]translation model[/i] of public philosophy, in which academics magnanimously explain their insights to the uninitiated, presupposes (and therefore creates and reinforces) a boundary between academic discourse and broader political discourse. The philosophers take the boundary to be indicative of a hierarchy: their discourse is superior. We call our society [i]anti-intellectual.[/i] And many thinkers, disparaged as charlatans by philosophers, rise up to fill the gap in public discourse. We discuss these very issues on the show.[/p]"
  }

]